In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("titanic_sdf").getOrCreate()
spark

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/07/29 12:07:28 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/07/29 12:07:31 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [12]:
filepath = "/home/ubuntu/working/spark-examples/data/titanic_train.csv"
titanic_sdf = spark.read.csv(filepath, inferSchema=True, header=True) # inferSchema : 컬럼 타입 자동 추론
titanic_sdf.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

In [13]:
titanic_pdf = titanic_sdf.select("*").toPandas()
titanic_pdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

# orderBy
- 한 개 이상의 컬럼을 기준으로 정렬하는 기능

In [14]:
# [Pandas] Name 컬럼 기준 오름차순 정렬
titanic_pdf.sort_values(by="Name", ascending=True).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
146,147,1,3,"""Andersson, Mr. August Edvard (""""Wennerstrom"""")""",male,27.0,0,0,350043,7.7958,None,S
518,519,1,2,"""Angle, Mrs. William A (Florence """"Mary"""" Agne...",female,36.0,1,0,226875,26.0000,None,S
290,291,1,1,"""Barber, Miss. Ellen """"Nellie""""""",female,26.0,0,0,19877,78.8500,None,S
624,625,0,3,"""Bowen, Mr. David John """"Dai""""""",male,21.0,0,0,54636,16.1000,None,S
507,508,1,1,"""Bradley, Mr. George (""""George Arthur Brayton"""")""",male,NaN,0,0,111427,26.5500,None,S

In [15]:
# [Pandas] Name 컬럼 오름차순, Age 내림 차순 정렬
titanic_pdf.sort_values(by=["Name", "Age"], ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
146,147,1,3,"""Andersson, Mr. August Edvard (""""Wennerstrom"""")""",male,27.0,0,0,350043,7.7958,None,S
518,519,1,2,"""Angle, Mrs. William A (Florence """"Mary"""" Agne...",female,36.0,1,0,226875,26.0000,None,S
290,291,1,1,"""Barber, Miss. Ellen """"Nellie""""""",female,26.0,0,0,19877,78.8500,None,S
624,625,0,3,"""Bowen, Mr. David John """"Dai""""""",male,21.0,0,0,54636,16.1000,None,S
507,508,1,1,"""Bradley, Mr. George (""""George Arthur Brayton"""")""",male,NaN,0,0,111427,26.5500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
286,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,None,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,None,S
361,362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,None,C
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,None,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,None,S

In [16]:
import pyspark.sql.functions as F
# [Spark] Pclass 내림차순 정렬
titanic_sdf.orderBy(F.col("Pclass"), ascending=False).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|          370371|   15.5| null|       Q|
|         26|       1|     3|Asplund, Mrs. Car...|female|38.0|    1|    5|          347077|31.3875| null|       S|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|         27|       0|     3|Emir, Mr. Farred ...|  male|null|    0|    0|            2631|  7.225| null|       C|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959| 7.8792| null|       Q|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         30|       0|     3| Todoroff, Mr. Lalio|  male|null|    0|    0|          349216| 7.8958| null|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|   7.75| null|       Q|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         37|       1|     3|    Mamee, Mr. Hanna|  male|null|    0|    0|            2677| 7.2292| null|       C|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         38|       0|     3|Cann, Mr. Ernest ...|  male|21.0|    0|    0|      A./5. 2152|   8.05| null|       S|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|           14311|   7.75| null|       Q|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|          345764|   18.0| null|       S|
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651|11.2417| null|       C|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [5]:
# [Spark] Pclass, Age 내림차순 정렬
titanic_sdf.orderBy(
    [F.col("Pclass"), F.col("Age")],
    ascending=False
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|    Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------+-------+-----+--------+
|        852|       0|     3| Svensson, Mr. Johan|  male|74.0|    0|    0|    347060|  7.775| null|       S|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|    370369|   7.75| null|       Q|
|        281|       0|     3|    Duane, Mr. Frank|  male|65.0|    0|    0|    336439|   7.75| null|       Q|
|        484|       1|     3|Turkula, Mrs. (He...|female|63.0|    0|    0|      4134| 9.5875| null|       S|
|        327|       0|     3|Nysveen, Mr. Joha...|  male|61.0|    0|    0|    345364| 6.2375| null|       S|
|         95|       0|     3|   Coxon, Mr. Daniel|  male|59.0|    0|    0|    364500|   7.25| null|       S|
|        153|       0|     3|    Meo, Mr. Alfonzo|  male|55.5|    0|    0|A.5. 11206|   8.05| null|       S|
|        223|       0|     3|Green, Mr. George...|  male|51.0|    0|    0|     21440|   8.05| null|       S|
|        407|       0|     3|Widegren, Mr. Car...|  male|51.0|    0|    0|    347064|   7.75| null|       S|
|        632|       0|     3|Lundahl, Mr. Joha...|  male|51.0|    0|    0|    347743| 7.0542| null|       S|
|        483|       0|     3|Rouse, Mr. Richar...|  male|50.0|    0|    0|  A/5 3594|   8.05| null|       S|
|        598|       0|     3| Johnson, Mr. Alfred|  male|49.0|    0|    0|      LINE|    0.0| null|       S|
|        737|       0|     3|Ford, Mrs. Edward...|female|48.0|    1|    3|W./C. 6608| 34.375| null|       S|
|        772|       0|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0|    350047| 7.8542| null|       S|
|        133|       0|     3|Robins, Mrs. Alex...|female|47.0|    1|    0| A/5. 3337|   14.5| null|       S|
|        593|       0|     3|Elsbury, Mr. Will...|  male|47.0|    0|    0|  A/5 3902|   7.25| null|       S|
|        874|       0|     3|Vander Cruyssen, ...|  male|47.0|    0|    0|    345765|    9.0| null|       S|
|        204|       0|     3|Youseff, Mr. Gerious|  male|45.5|    0|    0|      2628|  7.225| null|       C|
|        339|       1|     3|Dahl, Mr. Karl Ed...|  male|45.0|    0|    0|      7598|   8.05| null|       S|
|        363|       0|     3|Barbara, Mrs. (Ca...|female|45.0|    0|    1|      2691|14.4542| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------+-------+-----+--------+
only showing top 20 rows

In [6]:
# [Spark] Pclass 오름차순, Age 내림차순 정렬
titanic_sdf.orderBy(
    [F.col("Pclass"), F.col("Age")],
    ascending=[True, False]
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+---------+--------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|   Ticket|    Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+--------+-----------+--------+
|        631|       1|     1|Barkworth, Mr. Al...|  male|80.0|    0|    0|    27042|    30.0|        A23|       S|
|         97|       0|     1|Goldschmidt, Mr. ...|  male|71.0|    0|    0| PC 17754| 34.6542|         A5|       C|
|        494|       0|     1|Artagaveytia, Mr....|  male|71.0|    0|    0| PC 17609| 49.5042|       null|       C|
|        746|       0|     1|Crosby, Capt. Edw...|  male|70.0|    1|    1|WE/P 5735|    71.0|        B22|       S|
|         55|       0|     1|Ostby, Mr. Engelh...|  male|65.0|    0|    1|   113509| 61.9792|        B30|       C|
|        457|       0|     1|Millet, Mr. Franc...|  male|65.0|    0|    0|    13509|   26.55|        E38|       S|
|        439|       0|     1|   Fortune, Mr. Mark|  male|64.0|    1|    4|    19950|   263.0|C23 C25 C27|       S|
|        546|       0|     1|Nicholson, Mr. Ar...|  male|64.0|    0|    0|      693|    26.0|       null|       S|
|        276|       1|     1|Andrews, Miss. Ko...|female|63.0|    1|    0|    13502| 77.9583|         D7|       S|
|        253|       0|     1|Stead, Mr. Willia...|  male|62.0|    0|    0|   113514|   26.55|        C87|       S|
|        556|       0|     1|  Wright, Mr. George|  male|62.0|    0|    0|   113807|   26.55|       null|       S|
|        830|       1|     1|Stone, Mrs. Georg...|female|62.0|    0|    0|   113572|    80.0|        B28|    null|
|        171|       0|     1|Van der hoef, Mr....|  male|61.0|    0|    0|   111240|    33.5|        B19|       S|
|        626|       0|     1|Sutton, Mr. Frede...|  male|61.0|    0|    0|    36963| 32.3208|        D50|       S|
|        367|       1|     1|Warren, Mrs. Fran...|female|60.0|    1|    0|   110813|   75.25|        D37|       C|
|        588|       1|     1|Frolicher-Stehli,...|  male|60.0|    1|    1|    13567|    79.2|        B41|       C|
|        695|       0|     1|     Weir, Col. John|  male|60.0|    0|    0|   113800|   26.55|       null|       S|
|        269|       1|     1|Graham, Mrs. Will...|female|58.0|    0|    1| PC 17582|153.4625|       C125|       S|
|        196|       1|     1|Lurette, Miss. Elise|female|58.0|    0|    0| PC 17569|146.5208|        B80|       C|
|        488|       0|     1|Kent, Mr. Edward ...|  male|58.0|    0|    0|    11771|    29.7|        B37|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+--------+-----------+--------+
only showing top 20 rows

In [7]:
# orderBy와 동일한 메소드인 sort 사용하기
titanic_sdf.sort(
    F.col("Pclass").asc(),
    F.col("Age").desc()
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+---------+--------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|   Ticket|    Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+--------+-----------+--------+
|        631|       1|     1|Barkworth, Mr. Al...|  male|80.0|    0|    0|    27042|    30.0|        A23|       S|
|         97|       0|     1|Goldschmidt, Mr. ...|  male|71.0|    0|    0| PC 17754| 34.6542|         A5|       C|
|        494|       0|     1|Artagaveytia, Mr....|  male|71.0|    0|    0| PC 17609| 49.5042|       null|       C|
|        746|       0|     1|Crosby, Capt. Edw...|  male|70.0|    1|    1|WE/P 5735|    71.0|        B22|       S|
|         55|       0|     1|Ostby, Mr. Engelh...|  male|65.0|    0|    1|   113509| 61.9792|        B30|       C|
|        457|       0|     1|Millet, Mr. Franc...|  male|65.0|    0|    0|    13509|   26.55|        E38|       S|
|        439|       0|     1|   Fortune, Mr. Mark|  male|64.0|    1|    4|    19950|   263.0|C23 C25 C27|       S|
|        546|       0|     1|Nicholson, Mr. Ar...|  male|64.0|    0|    0|      693|    26.0|       null|       S|
|        276|       1|     1|Andrews, Miss. Ko...|female|63.0|    1|    0|    13502| 77.9583|         D7|       S|
|        253|       0|     1|Stead, Mr. Willia...|  male|62.0|    0|    0|   113514|   26.55|        C87|       S|
|        556|       0|     1|  Wright, Mr. George|  male|62.0|    0|    0|   113807|   26.55|       null|       S|
|        830|       1|     1|Stone, Mrs. Georg...|female|62.0|    0|    0|   113572|    80.0|        B28|    null|
|        171|       0|     1|Van der hoef, Mr....|  male|61.0|    0|    0|   111240|    33.5|        B19|       S|
|        626|       0|     1|Sutton, Mr. Frede...|  male|61.0|    0|    0|    36963| 32.3208|        D50|       S|
|        367|       1|     1|Warren, Mrs. Fran...|female|60.0|    1|    0|   110813|   75.25|        D37|       C|
|        588|       1|     1|Frolicher-Stehli,...|  male|60.0|    1|    1|    13567|    79.2|        B41|       C|
|        695|       0|     1|     Weir, Col. John|  male|60.0|    0|    0|   113800|   26.55|       null|       S|
|        269|       1|     1|Graham, Mrs. Will...|female|58.0|    0|    1| PC 17582|153.4625|       C125|       S|
|        196|       1|     1|Lurette, Miss. Elise|female|58.0|    0|    0| PC 17569|146.5208|        B80|       C|
|        488|       0|     1|Kent, Mr. Edward ...|  male|58.0|    0|    0|    11771|    29.7|        B37|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+--------+-----------+--------+
only showing top 20 rows

## 연습문제
다음 쿼리를 스파크 데이터  프레임으로 표현하세요.
1. ```SQL
select Pclass, Name
from ( select *
        from titanic_sdf
        order by Pclass asc, Name desc)
    ```
    
2. ``` SQL
select Pclass, Name
from titanic_sdf
order by Pclass asc, Name desc
```

In [9]:
titanic_sdf.sort(
F.col("Pclass").asc(),
F.col("Name").desc(),
).select(F.col("Pclass"), F.col("Name")).show()

+------+--------------------+
|Pclass|                Name|
+------+--------------------+
|     1|Young, Miss. Mari...|
|     1|  Wright, Mr. George|
|     1|   Woolner, Mr. Hugh|
|     1|Williams-Lambert,...|
|     1|Williams, Mr. Cha...|
|     1|Widener, Mr. Harr...|
|     1|Wick, Mrs. George...|
|     1|Wick, Miss. Mary ...|
|     1|White, Mr. Richar...|
|     1|White, Mr. Perciv...|
|     1|     Weir, Col. John|
|     1|Warren, Mrs. Fran...|
|     1|    Ward, Miss. Anna|
|     1|Walker, Mr. Willi...|
|     1|Van der hoef, Mr....|
|     1|Uruchurtu, Don. M...|
|     1|Thorne, Mrs. Gert...|
|     1|Thayer, Mrs. John...|
|     1|Thayer, Mr. John ...|
|     1|Thayer, Mr. John ...|
+------+--------------------+
only showing top 20 rows

In [11]:
titanic_sdf.select(F.col("Pclass"), F.col("Name")).orderBy([F.col("Pclass"), F.col("Name")],
    ascending=[True, False]
).show()

+------+--------------------+
|Pclass|                Name|
+------+--------------------+
|     1|Young, Miss. Mari...|
|     1|  Wright, Mr. George|
|     1|   Woolner, Mr. Hugh|
|     1|Williams-Lambert,...|
|     1|Williams, Mr. Cha...|
|     1|Widener, Mr. Harr...|
|     1|Wick, Mrs. George...|
|     1|Wick, Miss. Mary ...|
|     1|White, Mr. Richar...|
|     1|White, Mr. Perciv...|
|     1|     Weir, Col. John|
|     1|Warren, Mrs. Fran...|
|     1|    Ward, Miss. Anna|
|     1|Walker, Mr. Willi...|
|     1|Van der hoef, Mr....|
|     1|Uruchurtu, Don. M...|
|     1|Thorne, Mrs. Gert...|
|     1|Thayer, Mrs. John...|
|     1|Thayer, Mr. John ...|
|     1|Thayer, Mr. John ...|
+------+--------------------+
only showing top 20 rows

# Agg
- Spark DataFrame은 DataFrame 객체에서 집계 메소드가 별로 없다.
- 집계에 관련된 메소드 적용 시에는 `pyspark.sql.functions`에 있는 함수를 주로 사용

In [17]:
# [Pandas]
titanic_pdf['Age'].mean()

29.69911764705882

In [18]:
titanic_sdf.select(
    F.col("Age")
).mean()

AttributeError: 'DataFrame' object has no attribute 'mean'

In [23]:
# Count
print("Pandas DF : {}".format(titanic_pdf.count())) # 모든 컬럼의 데이터 개수
print()
print("Spark DF : {}".format(titanic_sdf.count())) # 전체 행의 개수.

Pandas DF : PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

Spark DF : 891

In [25]:
# 집계 함수 불러오기
# from pyspark.sql.functions import max, sum, min

titanic_sdf_max = titanic_sdf.select(
    F.max(F.col("Age")),
    F.min(F.col("Age")),
    F.sum(F.col("Age")),
)
titanic_sdf_max.show()

+--------+--------+--------+
|max(Age)|min(Age)|sum(Age)|
+--------+--------+--------+
|    80.0|    0.42|21205.17|
+--------+--------+--------+

# groupBy

In [26]:
titanic_pdf_groupby = titanic_pdf.groupby(by="Pclass")
titanic_pdf_groupby

In [27]:
titanic_pdf_groupby.count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [28]:
titanic_pdf_groupby["Age"].count()

Pclass
1    186
2    173
3    355
Name: Age, dtype: int64

In [29]:
titanic_pdf_groupby["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [30]:
# 특정 컬럼에 특정 집계 연산 수행 - agg
# 각 컬럼별 집계 연산을 다르게 적용도 가능함!
agg_format = {
    "Age" : "max", 
    "SibSp" : "sum",
    "Fare" : "mean"
}

titanic_pdf_groupby.agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [31]:
# [Spark] groupby
titanic_sdf.groupby(
    F.col("Pclass")
).count().show()

+------+-----+
|Pclass|count|
+------+-----+
|     1|  216|
|     3|  491|
|     2|  184|
+------+-----+

In [32]:
titanic_sdf.groupby(
    F.col("Pclass")
)

In [33]:
# 탑승지 별로 가장 많이 탄 순서대로 정렬
titanic_sdf.groupby(
    F.col("Pclass")
).count().orderBy(
    F.col("count"), ascending=False
).show()

+------+-----+
|Pclass|count|
+------+-----+
|     3|  491|
|     1|  216|
|     2|  184|
+------+-----+

In [35]:
# 다른 집계 함수를 써보자
# count가 아닌 다른 집계 함수를 groupby를 이용해서 특정 컬럼에 적용하면 pandas 데이터프레임과 유사하게 컬럼 레벨로 전체 집계
# groupby를 이용해서 특정 컬럼에 집계 함수를 적용하면 pandas 데이터프레임과 유사하게 컬럼 레벨로 전체 집계
titanic_sdf.groupby("Pclass").max().show()

+------+----------------+-------------+-----------+--------+----------+----------+---------+
|Pclass|max(PassengerId)|max(Survived)|max(Pclass)|max(Age)|max(SibSp)|max(Parch)|max(Fare)|
+------+----------------+-------------+-----------+--------+----------+----------+---------+
|     1|             890|            1|          1|    80.0|         3|         4| 512.3292|
|     3|             891|            1|          3|    74.0|         8|         6|    69.55|
|     2|             887|            1|          2|    70.0|         3|         3|     73.5|
+------+----------------+-------------+-----------+--------+----------+----------+---------+

In [36]:
# 집계 함수에는 컬럼명을 문자여열로 지정
titanic_sdf.groupBy("Pclass").max("Age").show()

+------+--------+
|Pclass|max(Age)|
+------+--------+
|     1|    80.0|
|     3|    74.0|
|     2|    70.0|
+------+--------+

In [37]:
# 집계 기준을 여러 개 적용하기
titanic_sdf.groupby(
    [F.col("Pclass"), F.col("Embarked")]
).max("Age").show()

+------+--------+--------+
|Pclass|Embarked|max(Age)|
+------+--------+--------+
|     3|       C|    45.5|
|     2|       C|    36.0|
|     1|    null|    62.0|
|     1|       Q|    44.0|
|     3|       Q|    70.5|
|     2|       Q|    57.0|
|     1|       C|    71.0|
|     1|       S|    80.0|
|     3|       S|    74.0|
|     2|       S|    70.0|
+------+--------+--------+

In [39]:
# agg 사용 시에는 F.col 사용 가능
titanic_sdf.groupby("Pclass").agg(
    F.max("Age").alias("age_max"),
    F.min("Age").alias("age_min"),   
    F.sum(F.col("Age")).alias("age_sum"),
    F.avg("Age")
).show()

+------+-------+-------+-------+------------------+
|Pclass|age_max|age_min|age_sum|          avg(Age)|
+------+-------+-------+-------+------------------+
|     1|   80.0|   0.92|7111.42|38.233440860215055|
|     3|   74.0|   0.42|8924.92| 25.14061971830986|
|     2|   70.0|   0.67|5168.83| 29.87763005780347|
+------+-------+-------+-------+------------------+